archives/2024/Results/Verifications/S2427/bottleneck-determination/read_only/threads-28/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=28 oltp_read_only --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-type=
uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 28
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 28 tps: 260.38 qps: 4192.80 (r/w/o: 3669.45/0.00/523.35) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 28 tps: 268.22 qps: 4290.89 (r/w/o: 3754.45/0.00/536.44) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 28 tps: 299.30 qps: 4790.78 (r/w/o: 4192.08/0.00/598.70) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 28 tps: 267.40 qps: 4277.40 (r/w/o: 3742.60/0.00/534.80) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 28 tps: 276.19 qps: 4419.63 (r/w/o: 3867.15/0.00/552.48) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 28 tps: 295.19 qps: 4720.61 (r/w/o: 4130.32/0.00/590.29) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 28 tps: 257.70 qps: 4129.11 (r/w/o: 3613.71/0.00/515.40) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 28 tps: 260.20 qps: 4159.40 (r/w/o: 3639.10/0.00/520.30) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 28 tps: 279.70 qps: 4474.81 (r/w/o: 3915.41/0.00/559.40) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 28 tps: 253.30 qps: 4057.13 (r/w/o: 3550.44/0.00/506.69) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            380870
        write:                           0
        other:                           54410
        total:                           435280
    transactions:                        27205  (271.74 per sec.)
    queries:                             435280 (4347.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.1089s
    total number of events:              27205

Latency (ms):
         min:                                   54.11
         avg:                                  102.97
         max:                                 1988.41
         95th percentile:                      161.51
         sum:                              2801257.40

Threads fairness:
    events (avg/stddev):           971.6071/7.51
    execution time (avg/stddev):   100.0449/0.03


real    1m40.451s
user    0m18.492s
sys     0m21.187s